commit ca87e77a2ef8b298aa9f69658d5898e72ee450fe
Author: Greg Kroah-Hartman <gregkh@linuxfoundation.org>
Date:   Wed Jun 14 11:15:34 2023 +0200

    Linux 6.1.34
    
    Link: https://lore.kernel.org/r/20230612101710.279705932@linuxfoundation.org
    Tested-by: Chris Paterson (CIP) <chris.paterson2@renesas.com>
    Tested-by: Shuah Khan <skhan@linuxfoundation.org>
    Tested-by: Bagas Sanjaya <bagasdotme@gmail.com>
    Tested-by: Linux Kernel Functional Testing <lkft@linaro.org>
    Tested-by: Jon Hunter <jonathanh@nvidia.com>
    Tested-by: Conor Dooley <conor.dooley@microchip.com>
    Tested-by: Takeshi Ogasawara <takeshi.ogasawara@futuring-girl.com>
    Tested-by: Sudip Mukherjee <sudip.mukherjee@codethink.co.uk>
    Tested-by: Salvatore Bonaccorso <carnil@debian.org>
    Tested-by: Guenter Roeck <linux@roeck-us.net>
    Tested-by: Ron Economos <re@w6rz.net>
    Signed-off-by: Greg Kroah-Hartman <gregkh@linuxfoundation.org>

commit 1aaa74177f062f978c33f8547436326d1fd1be1e
Author: Greg Kroah-Hartman <gregkh@linuxfoundation.org>
Date:   Mon Jun 12 12:06:32 2023 +0200

    Revert "staging: rtl8192e: Replace macro RTL_PCI_DEVICE with PCI_DEVICE"
    
    This reverts commit ec310591cf839653a5b2c1fcf6b8a110c3f2485c which is
    commit fda2093860df4812d69052a8cf4997e53853a340 upstream.
    
    Ben reports that this should not have been backported to the older
    kernels as the rest of the macro is not empty.  It was a clean-up patch

    Without this patch, when a TP session is initiated and a Clear To Send
    (CTS) frame is received from the remote side requesting one data packet,
    the kernel dispatches the first Data Transport (DT) frame and then waits
    for the next CTS. If the remote side doesn't respond with another CTS,
    the kernel aborts due to a timeout. This leads to the user-space
    receiving an EPOLLERR on the socket, and the socket becomes active.
    
    However, when trying to read the error queue from the socket with
    sock.recvmsg(, , socket.MSG_ERRQUEUE), it returns -EAGAIN,
    given that the socket is non-blocking. This situation results in an
    infinite loop: the user-space repeatedly calls epoll(), epoll() returns
    the socket file descriptor with EPOLLERR, but the socket then blocks on
    the recv() of ERRQUEUE.
    
    This patch introduces an additional check for the J1939_SOCK_ERRQUEUE
    flag within the j1939_sk_send_loop_abort() function. If the flag is set,
    it indicates that the application has subscribed to receive error queue
    messages. In such cases, the kernel can communicate the current transfer
    state via the error queue. This allows for the function to return early,
    preventing the unnecessary setting of the socket into an error state,
    and breaking the infinite loop. It is crucial to note that a socket
    error is only needed if the application isn't using the error queue, as,
    without it, the application wouldn't be aware of transfer issues.
    
    Fixes: 9d71dd0c7009 ("can: add support of SAE J1939 protocol")
    Reported-by: David Jander <david@protonic.nl>
    Tested-by: David Jander <david@protonic.nl>
    Signed-off-by: Oleksij Rempel <o.rempel@pengutronix.de>
    Link: https://lore.kernel.org/r/20230526081946.715190-1-o.rempel@pengutronix.de
    Cc: stable@vger.kernel.org
    Signed-off-by: Marc Kleine-Budde <mkl@pengutronix.de>
    Signed-off-by: Greg Kroah-Hartman <gregkh@linuxfoundation.org>

commit 727964650a126ff1e7a91ceaac0bd8db93e88a49
Author: Gustavo A. R. Silva <gustavoars@kernel.org>
Date:   Fri Jun 2 13:42:47 2023 -0600

    wifi: iwlwifi: mvm: Fix -Warray-bounds bug in iwl_mvm_wait_d3_notif()
    
    commit 7a4615b9a9da5225b22b36a20508555dd133ac24 upstream.
    
    kmemdup() at line 2735 is not duplicating enough memory for
    notif->tid_tear_down and notif->station_id. As it only duplicates
    612 bytes: up to offsetofend(struct iwl_wowlan_info_notif,
    received_beacons), this is the range of [0, 612) bytes.
    
    2735    notif = kmemdup(notif_v1,
    2736                    offsetofend(struct iwl_wowlan_info_notif,
    2737                                received_beacons),
    2738                    GFP_ATOMIC);
    
    which evidently does not cover bytes 612 and 613 for members
    tid_tear_down and station_id in struct iwl_wowlan_info_notif.
    See below:
    
    $ pahole -C iwl_wowlan_info_notif drivers/net/wireless/intel/iwlwifi/mvm/d3.o
    struct iwl_wowlan_info_notif {
            struct iwl_wowlan_gtk_status_v3 gtk[2];          /*     0   488 */
            /* --- cacheline 7 boundary (448 bytes) was 40 bytes ago --- */
            struct iwl_wowlan_igtk_status igtk[2];           /*   488    80 */
            /* --- cacheline 8 boundary (512 bytes) was 56 bytes ago --- */
            __le64                     replay_ctr;           /*   568     8 */
            /* --- cacheline 9 boundary (576 bytes) --- */
            __le16                     pattern_number;       /*   576     2 */
            __le16                     reserved1;            /*   578     2 */
            __le16                     qos_seq_ctr[8];       /*   580    16 */
            __le32                     wakeup_reasons;       /*   596     4 */
            __le32                     num_of_gtk_rekeys;    /*   600     4 */
            __le32                     transmitted_ndps;     /*   604     4 */
            __le32                     received_beacons;     /*   608     4 */
            u8                         tid_tear_down;        /*   612     1 */
            u8                         station_id;           /*   613     1 */
            u8                         reserved2[2];         /*   614     2 */
    
            /* size: 616, cachelines: 10, members: 13 */
            /* last cacheline: 40 bytes */
    };
    
    Therefore, when the following assignments take place, actually no memory
    has been allocated for those objects:
    
    2743    notif->tid_tear_down = notif_v1->tid_tear_down;
    2744    notif->station_id = notif_v1->station_id;
    
    Fix this by allocating space for the whole notif object and zero out the
    remaining space in memory after member station_id.
    
    This also fixes the following -Warray-bounds issues:
     CC      drivers/net/wireless/intel/iwlwifi/mvm/d3.o
    drivers/net/wireless/intel/iwlwifi/mvm/d3.c: In function ‘iwl_mvm_wait_d3_notif’:
    drivers/net/wireless/intel/iwlwifi/mvm/d3.c:2743:30: warning: array subscript ‘struct iwl_wowlan_info_notif[0]’ is partly outside array bounds of ‘unsigned char[612]’ [-Warray-bounds=]
     2743 |                         notif->tid_tear_down = notif_v1->tid_tear_down;
