commit 3a3877de44342d0a09216dfbe674a404e8f5e96f
Author: Greg Kroah-Hartman <gregkh@linuxfoundation.org>
Date:   Fri Jun 21 14:54:16 2024 +0200

    Linux 5.10.220
    
    Link: https://lore.kernel.org/r/20240618123407.280171066@linuxfoundation.org
    Tested-by: Jon Hunter <jonathanh@nvidia.com>
    Tested-by: Pavel Machek (CIP) <pavel@denx.de>
    Tested-by: Dominique Martinet <dominique.martinet@atmark-techno.com>
    Tested-by: Florian Fainelli <florian.fainelli@broadcom.com>
    Tested-by: Linux Kernel Functional Testing <lkft@linaro.org>
    Tested-by: Salvatore Bonaccorso <carnil@debian.org>
    Signed-off-by: Greg Kroah-Hartman <gregkh@linuxfoundation.org>

commit 9444ce5cd48802188b73315dfde9e341fc3f75a2
Author: Trond Myklebust <trond.myklebust@hammerspace.com>
Date:   Thu Feb 15 20:24:50 2024 -0500

    nfsd: Fix a regression in nfsd_setattr()
    
    [ Upstream commit 6412e44c40aaf8f1d7320b2099c5bdd6cb9126ac ]
    
    Commit bb4d53d66e4b ("NFSD: use (un)lock_inode instead of
    fh_(un)lock for file operations") broke the NFSv3 pre/post op
    attributes behaviour when doing a SETATTR rpc call by stripping out
    the calls to fh_fill_pre_attrs() and fh_fill_post_attrs().
    
    Fixes: bb4d53d66e4b ("NFSD: use (un)lock_inode instead of fh_(un)lock for file operations")
    Signed-off-by: Trond Myklebust <trond.myklebust@hammerspace.com>
    Reviewed-by: Jeff Layton <jlayton@kernel.org>
    Reviewed-by: NeilBrown <neilb@suse.de>

commit 4f14948942937eeb2f4c363f5912d143049cdf26
Author: Chuck Lever <chuck.lever@oracle.com>
Date:   Thu Mar 7 09:22:43 2024 -0500

    Revert "fanotify: limit number of event merge attempts"
    
    Temporarily revert commit ad3ea16746cc ("fanotify: limit number of
    event merge attempts") to enable subsequent upstream commits to
    apply and build cleanly.
    
    Stable-dep-of: 8988f11abb82 ("fanotify: reduce event objectid to 29-bit hash")
    Signed-off-by: Chuck Lever <chuck.lever@oracle.com>
    Signed-off-by: Sasha Levin <sashal@kernel.org>

commit 62b7f3847373a48568162419f3a2250bce048756
Author: Amir Goldstein <amir73il@gmail.com>
Date:   Thu Mar 4 12:48:22 2021 +0200

    fsnotify: allow fsnotify_{peek,remove}_first_event with empty queue
    
    [ Upstream commit 6f73171e192366ff7c98af9fb50615ef9615f8a7 ]
    
    Current code has an assumtion that fsnotify_notify_queue_is_empty() is
    called to verify that queue is not empty before trying to peek or remove
    an event from queue.
    
    Remove this assumption by moving the fsnotify_notify_queue_is_empty()
    into the functions, allow them to return NULL value and check return
    value by all callers.
    
    This is a prep patch for multi event queues.
    
    Link: https://lore.kernel.org/r/20210304104826.3993892-2-amir73il@gmail.com
    Signed-off-by: Amir Goldstein <amir73il@gmail.com>
    Signed-off-by: Jan Kara <jack@suse.cz>
    Signed-off-by: Chuck Lever <chuck.lever@oracle.com>
    Signed-off-by: Sasha Levin <sashal@kernel.org>

commit d9168ab8d714e7931438088dba3eb79c5a04152d
Author: Guobin Huang <huangguobin4@huawei.com>
Date:   Tue Apr 6 20:08:18 2021 +0800

    NFSD: Use DEFINE_SPINLOCK() for spinlock
    
    [ Upstream commit b73ac6808b0f7994a05ebc38571e2e9eaf98a0f4 ]
    
    spinlock can be initialized automatically with DEFINE_SPINLOCK()
    rather than explicitly calling spin_lock_init().
    
    Reported-by: Hulk Robot <hulkci@huawei.com>
    Signed-off-by: Guobin Huang <huangguobin4@huawei.com>
    Signed-off-by: Chuck Lever <chuck.lever@oracle.com>
    Signed-off-by: Sasha Levin <sashal@kernel.org>

commit b20d88bf1eab5f33103457f535dad686c849b325
Author: Gustavo A. R. Silva <gustavoars@kernel.org>
Date:   Tue Mar 23 17:48:58 2021 -0500

    UAPI: nfsfh.h: Replace one-element array with flexible-array member
    
    [ Upstream commit c0a744dcaa29e9537e8607ae9c965ad936124a4d ]
    
    There is a regular need in the kernel to provide a way to declare having
    a dynamically sized set of trailing elements in a structure. Kernel code
    should always use “flexible array members”[1] for these cases. The older
    style of one-element or zero-length arrays should no longer be used[2].
    
    Use an anonymous union with a couple of anonymous structs in order to
    keep userspace unchanged:
    
    $ pahole -C nfs_fhbase_new fs/nfsd/nfsfh.o
    struct nfs_fhbase_new {
            union {
                    struct {
                            __u8       fb_version_aux;       /*     0     1 */
                            __u8       fb_auth_type_aux;     /*     1     1 */
                            __u8       fb_fsid_type_aux;     /*     2     1 */
                            __u8       fb_fileid_type_aux;   /*     3     1 */
                            __u32      fb_auth[1];           /*     4     4 */
                    };                                       /*     0     8 */
                    struct {
                            __u8       fb_version;           /*     0     1 */
                            __u8       fb_auth_type;         /*     1     1 */
                            __u8       fb_fsid_type;         /*     2     1 */
                            __u8       fb_fileid_type;       /*     3     1 */
                            __u32      fb_auth_flex[0];      /*     4     0 */
                    };                                       /*     0     4 */
            };                                               /*     0     8 */
    
            /* size: 8, cachelines: 1, members: 1 */
            /* last cacheline: 8 bytes */
    };
    
    Also, this helps with the ongoing efforts to enable -Warray-bounds by
    fixing the following warnings:
    
    fs/nfsd/nfsfh.c: In function ‘nfsd_set_fh_dentry’:
    fs/nfsd/nfsfh.c:191:41: warning: array subscript 1 is above array bounds of ‘__u32[1]’ {aka ‘unsigned int[1]’} [-Warray-bounds]
      191 |        ntohl((__force __be32)fh->fh_fsid[1])));
          |                              ~~~~~~~~~~~^~~
    ./include/linux/kdev_t.h:12:46: note: in definition of macro ‘MKDEV’
       12 | #define MKDEV(ma,mi) (((ma) << MINORBITS) | (mi))
          |                                              ^~
    ./include/uapi/linux/byteorder/little_endian.h:40:26: note: in expansion of macro ‘__swab32’
       40 | #define __be32_to_cpu(x) __swab32((__force __u32)(__be32)(x))
