commit dfa3825910910406ed7f7aeb75296bcd004dd119
Author: Sasha Levin <sashal@kernel.org>
Date:   Sun Mar 24 14:38:39 2024 -0400

    Linux 5.10.214
    
    Tested-by: Florian Fainelli <florian.fainelli@broadcom.com>
    Tested-by: Pavel Machek (CIP) <pavel@denx.de>
    Tested-by: Linux Kernel Functional Testing <lkft@linaro.org>
    Signed-off-by: Sasha Levin <sashal@kernel.org>

commit 5148026b65cac1156111c0229f96d7afc5812a48
Author: Arnd Bergmann <arnd@arndb.de>
Date:   Wed Apr 21 16:00:40 2021 +0200

    remoteproc: stm32: fix phys_addr_t format string
    
    commit 3e25e407a1c93b53a87a7743ea0cd4703d3985b7 upstream.
    
    A phys_addr_t may be wider than an int or pointer:
    
    drivers/remoteproc/stm32_rproc.c: In function 'stm32_rproc_da_to_pa':
    drivers/remoteproc/stm32_rproc.c:583:30: error: format '%x' expects argument of type 'unsigned int', but argument 5 has type 'phys_addr_t' {aka 'long long unsigned int'} [-Werror=format=]
      583 |                 dev_dbg(dev, "da %llx to pa %#x\n", da, *pa);
    
    Print it by reference using the special %pap format string.
    
    Reviewed-by: Arnaud Pouliquen <arnaud.pouliquen@foss.st.com>
    Fixes: 8a471396d21c ("remoteproc: stm32: Move resource table setup to rproc_ops")
    Signed-off-by: Arnd Bergmann <arnd@arndb.de>
    Link: https://lore.kernel.org/r/20210421140053.3727528-1-arnd@kernel.org
    Signed-off-by: Bjorn Andersson <bjorn.andersson@linaro.org>

Date:   Thu Mar 7 14:23:50 2024 +0000

    ipmr: fix incorrect parameter validation in the ip_mroute_getsockopt() function
    
    [ Upstream commit 5c3be3e0eb44b7f978bb6cbb20ad956adb93f736 ]
    
    The 'olr' variable can't be negative when assigned the result of
    'min_t' because all 'min_t' parameters are cast to unsigned int,
    and then the minimum one is chosen.
    
    To fix the logic, check 'olr' as read from 'optlen',
    where the types of relevant variables are (signed) int.
    
    Fixes: 1da177e4c3f4 ("Linux-2.6.12-rc2")
    Signed-off-by: Gavrilov Ilia <Ilia.Gavrilov@infotecs.ru>
    Signed-off-by: David S. Miller <davem@davemloft.net>
    Signed-off-by: Sasha Levin <sashal@kernel.org>

commit 8693e3cf0c968ce7489f00d5cf8afc5d9a261ceb
Author: Martin KaFai Lau <martin.lau@kernel.org>
Date:   Thu Sep 1 17:28:28 2022 -0700

    bpf: net: Change do_ip_getsockopt() to take the sockptr_t argument
    
    [ Upstream commit 728f064cd7ebea8c182e99e6f152c8b4a0a6b071 ]
    
    Similar to the earlier patch that changes sk_getsockopt() to
    take the sockptr_t argument.  This patch also changes
    do_ip_getsockopt() to take the sockptr_t argument such that
    a latter patch can make bpf_getsockopt(SOL_IP) to reuse
    do_ip_getsockopt().
    
    Note on the change in ip_mc_gsfget().  This function is to
    return an array of sockaddr_storage in optval.  This function
    is shared between ip_get_mcast_msfilter() and
    compat_ip_get_mcast_msfilter().  However, the sockaddr_storage
    is stored at different offset of the optval because of
    the difference between group_filter and compat_group_filter.
    Thus, a new 'ss_offset' argument is added to ip_mc_gsfget().
    
    Signed-off-by: Martin KaFai Lau <martin.lau@kernel.org>
    Link: https://lore.kernel.org/r/20220902002828.2890585-1-kafai@fb.com
    Signed-off-by: Alexei Starovoitov <ast@kernel.org>
    Stable-dep-of: 5c3be3e0eb44 ("ipmr: fix incorrect parameter validation in the ip_mroute_getsockopt() function")
    Signed-off-by: Sasha Levin <sashal@kernel.org>

commit 415edd2d661cc5fb0e5ef02127a7823dce69ab9e
Author: Gustavo A. R. Silva <gustavoars@kernel.org>
Date:   Wed Aug 4 15:45:36 2021 -0500

    net/ipv4/ipv6: Replace one-element arraya with flexible-array members
    
    [ Upstream commit db243b796439c0caba47865564d8acd18a301d18 ]
    
    There is a regular need in the kernel to provide a way to declare having
    a dynamically sized set of trailing elements in a structure. Kernel code
    should always use “flexible array members”[1] for these cases. The older
    style of one-element or zero-length arrays should no longer be used[2].
    
    Use an anonymous union with a couple of anonymous structs in order to
    keep userspace unchanged and refactor the related code accordingly:
    
    $ pahole -C group_filter net/ipv4/ip_sockglue.o
    struct group_filter {
            union {
                    struct {
                            __u32      gf_interface_aux;     /*     0     4 */
    
                            /* XXX 4 bytes hole, try to pack */
    
                            struct __kernel_sockaddr_storage gf_group_aux; /*     8   128 */
                            /* --- cacheline 2 boundary (128 bytes) was 8 bytes ago --- */
                            __u32      gf_fmode_aux;         /*   136     4 */
                            __u32      gf_numsrc_aux;        /*   140     4 */
                            struct __kernel_sockaddr_storage gf_slist[1]; /*   144   128 */
                    };                                       /*     0   272 */
                    struct {
                            __u32      gf_interface;         /*     0     4 */
    
                            /* XXX 4 bytes hole, try to pack */
    
                            struct __kernel_sockaddr_storage gf_group; /*     8   128 */
                            /* --- cacheline 2 boundary (128 bytes) was 8 bytes ago --- */
                            __u32      gf_fmode;             /*   136     4 */
                            __u32      gf_numsrc;            /*   140     4 */
                            struct __kernel_sockaddr_storage gf_slist_flex[0]; /*   144     0 */
                    };                                       /*     0   144 */
            };                                               /*     0   272 */
    
            /* size: 272, cachelines: 5, members: 1 */
            /* last cacheline: 16 bytes */
    };
    
    $ pahole -C compat_group_filter net/ipv4/ip_sockglue.o
    struct compat_group_filter {
            union {
                    struct {
                            __u32      gf_interface_aux;     /*     0     4 */
                            struct __kernel_sockaddr_storage gf_group_aux __attribute__((__aligned__(4))); /*     4   128 */
                            /* --- cacheline 2 boundary (128 bytes) was 4 bytes ago --- */
                            __u32      gf_fmode_aux;         /*   132     4 */
                            __u32      gf_numsrc_aux;        /*   136     4 */
                            struct __kernel_sockaddr_storage gf_slist[1] __attribute__((__aligned__(4))); /*   140   128 */
                    } __attribute__((__packed__)) __attribute__((__aligned__(4)));                     /*     0   268 */
                    struct {
                            __u32      gf_interface;         /*     0     4 */
                            struct __kernel_sockaddr_storage gf_group __attribute__((__aligned__(4))); /*     4   128 */
                            /* --- cacheline 2 boundary (128 bytes) was 4 bytes ago --- */
                            __u32      gf_fmode;             /*   132     4 */
                            __u32      gf_numsrc;            /*   136     4 */
                            struct __kernel_sockaddr_storage gf_slist_flex[0] __attribute__((__aligned__(4))); /*   140     0 */
                    } __attribute__((__packed__)) __attribute__((__aligned__(4)));                     /*     0   140 */
            } __attribute__((__aligned__(1)));               /*     0   268 */
    
            /* size: 268, cachelines: 5, members: 1 */
            /* forced alignments: 1 */
            /* last cacheline: 12 bytes */
    } __attribute__((__packed__));
    
    This helps with the ongoing efforts to globally enable -Warray-bounds
    and get us closer to being able to tighten the FORTIFY_SOURCE routines
    on memcpy().
    
    [1] https://en.wikipedia.org/wiki/Flexible_array_member
    [2] https://www.kernel.org/doc/html/v5.10/process/deprecated.html#zero-length-and-one-element-arrays
    
    Link: https://github.com/KSPP/linux/issues/79
    Link: https://github.com/KSPP/linux/issues/109
    Signed-off-by: Gustavo A. R. Silva <gustavoars@kernel.org>
    Signed-off-by: David S. Miller <davem@davemloft.net>
    Stable-dep-of: 5c3be3e0eb44 ("ipmr: fix incorrect parameter validation in the ip_mroute_getsockopt() function")
    Signed-off-by: Sasha Levin <sashal@kernel.org>

commit 7394669d5987333ec3e442c55864f0a1c63fe481
Author: Gustavo A. R. Silva <gustavoars@kernel.org>
Date:   Wed Aug 4 13:23:25 2021 -0500

    net/ipv4: Revert use of struct_size() helper
    
    [ Upstream commit 4167a960574fcadc9067f4280951a35b8c021c68 ]
    
    Revert the use of structr_size() and stay with IP_MSFILTER_SIZE() for
    now, as in this case, the size of struct ip_msfilter didn't change with
    the addition of the flexible array imsf_slist_flex[]. So, if we use
    struct_size() we will be allocating and calculating the size of
    struct ip_msfilter with one too many items for imsf_slist_flex[].
    
    We might use struct_size() in the future, but for now let's stay
    with IP_MSFILTER_SIZE().
    
    Fixes: 2d3e5caf96b9 ("net/ipv4: Replace one-element array with flexible-array member")
    Signed-off-by: Gustavo A. R. Silva <gustavoars@kernel.org>
    Signed-off-by: David S. Miller <davem@davemloft.net>
    Stable-dep-of: 5c3be3e0eb44 ("ipmr: fix incorrect parameter validation in the ip_mroute_getsockopt() function")
    Signed-off-by: Sasha Levin <sashal@kernel.org>

commit 1ebd0d898fae79782c835992ae4ad92244f53a4e
Author: Gustavo A. R. Silva <gustavoars@kernel.org>
Date:   Sat Jul 31 12:08:30 2021 -0500

    net/ipv4: Replace one-element array with flexible-array member
    
    [ Upstream commit 2d3e5caf96b9449af951e63476657acd759c1a30 ]
    
    There is a regular need in the kernel to provide a way to declare having
    a dynamically sized set of trailing elements in a structure. Kernel code
    should always use “flexible array members”[1] for these cases. The older
    style of one-element or zero-length arrays should no longer be used[2].
    
    Use an anonymous union with a couple of anonymous structs in order to
    keep userspace unchanged:
    
    $ pahole -C ip_msfilter net/ipv4/ip_sockglue.o
    struct ip_msfilter {
            union {
                    struct {
                            __be32     imsf_multiaddr_aux;   /*     0     4 */
                            __be32     imsf_interface_aux;   /*     4     4 */
                            __u32      imsf_fmode_aux;       /*     8     4 */
                            __u32      imsf_numsrc_aux;      /*    12     4 */
                            __be32     imsf_slist[1];        /*    16     4 */
                    };                                       /*     0    20 */
                    struct {
                            __be32     imsf_multiaddr;       /*     0     4 */
                            __be32     imsf_interface;       /*     4     4 */
                            __u32      imsf_fmode;           /*     8     4 */
                            __u32      imsf_numsrc;          /*    12     4 */
                            __be32     imsf_slist_flex[0];   /*    16     0 */
                    };                                       /*     0    16 */
            };                                               /*     0    20 */
    
            /* size: 20, cachelines: 1, members: 1 */
            /* last cacheline: 20 bytes */
    };
    
    Also, refactor the code accordingly and make use of the struct_size()
    and flex_array_size() helpers.
    
    This helps with the ongoing efforts to globally enable -Warray-bounds
    and get us closer to being able to tighten the FORTIFY_SOURCE routines
    on memcpy().
    
    [1] https://en.wikipedia.org/wiki/Flexible_array_member
    [2] https://www.kernel.org/doc/html/v5.10/process/deprecated.html#zero-length-and-one-element-arrays
    
    Link: https://github.com/KSPP/linux/issues/79
    Link: https://github.com/KSPP/linux/issues/109
    Signed-off-by: Gustavo A. R. Silva <gustavoars@kernel.org>
    Signed-off-by: David S. Miller <davem@davemloft.net>
    Stable-dep-of: 5c3be3e0eb44 ("ipmr: fix incorrect parameter validation in the ip_mroute_getsockopt() function")
